In [83]:
#===================================================================
#   Date: 09/18/2021
#   Description - Import and anyalize Titanic data
#===================================================================

import numpy as np
import pandas as pd

#The Machine learning alogorithm
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression

# Test train split
from sklearn.model_selection import train_test_split

# Import Titanic file for class assignment
train = pd.read_excel("CS379T-Week-1-IP.xls")
train.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [84]:
# Preprocess all the data for cleanup
train.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [85]:
train.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [86]:
# Using two columns to perform work
# This will simplify the algorithm for testing
train_x = train[["pclass", "sex"]]
train_x.head()

   pclass     sex
0       1  female
1       1    male
2       1  female
3       1    male
4       1  female

In [87]:
# Selecting the output/ target variable
# This is what we are testing for
train_y = train[["survived"]]
train_y.head()

   survived
0         1
1         1
2         0
3         0
4         0

In [88]:
# Convert to usable data types
train_x["sex"].replace("male", 1, inplace = True)
train_x["sex"].replace("female", 0, inplace = True)
train_x.head()

   pclass  sex
0       1    0
1       1    1
2       1    0
3       1    1
4       1    0

In [89]:
# Final dataset for validation
tr_x, cv_x, tr_y, cv_y   = train_test_split(train_x, train_y, test_size = 0.30)
print(tr_x.head())
print(tr_y.head())

      pclass  sex
478        2    0
1150       3    1
989        3    1
542        2    0
58         1    1
      survived
478          1
1150         0
989          0
542          1
58           0

In [90]:
# Using Random Forest algorithm
rf = RandomForestClassifier()

In [91]:
# Fitting and training the above called algorithm
rf.fit(tr_x, tr_y)

RandomForestClassifier()

In [92]:
# Test accuracy
Accuracy_RandomForest = rf.score(cv_x, cv_y)
print("Accuracy = {}%".format(Accuracy_RandomForest * 100))

Accuracy = 75.57251908396947%

In [93]:
# Initialize logistic regression
lgr = LogisticRegression()
lgr.fit(tr_x, tr_y)

LogisticRegression()

In [94]:
# Check accuracy
Accuracy_LogisticRegression = lgr.score(cv_x, cv_y)
print("Accuracy = {}%".format(Accuracy_LogisticRegression * 100))

Accuracy = 75.57251908396947%

In [95]:
# Read in test data csv (included in upload)
# This only has one record but can contain many
# The record is just my information
# ACcording to my machine learning, I would not survive the Titanic
test = pd.read_csv("testdata.csv")
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked\t
0,1,3,Lionel Standridge,male,34.5,0,0,330911,7.8292,NaN,Q

In [96]:
# Clean test data
test_x = test[["Pclass", "Sex"]]
test_x.head()

   Pclass   Sex
0       3  male

In [97]:
# Convert to usable types
test_x["Sex"].replace("male", 1, inplace = True)
test_x["Sex"].replace("female", 0, inplace = True)
test_x.head()

   Pclass  Sex
0       3    1

In [98]:
prd = rf.predict(test_x)
prd

array([0], dtype=int64)

In [99]:
op = test[['PassengerId']]

In [100]:
op['Survived'] = prd

In [ ]:
# Output results of full test
# Lionel does not survive
op.head()